app/views/users/show.html.erb

<div class="row">
  <% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 2]]