app/views/photos/edit.html.erb

SELECT "tags".* FROM "tags"
---
  <%= f.label :choose_tags %>
  <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %><br><br>