app/views/photos/new.html.erb

  <%= f.label :choose_tags %>
  <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name %><br><br>
---
SELECT "tags".* FROM "tags"