app/views/photos/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "photo_tags" ON "tags"."id" = "photo_tags"."tag_id" WHERE "photo_tags"."photo_id" = ?  [["photo_id", 1]]
---
    Posted by <%= link_to @photo.user.name, user_path(@photo.user) %><br><br>
    Tags: <% @photo.tags.each do |tag| %>