app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT "photos".* FROM "photos"

  def add_vote
   @photo = Photo.find(params[:id])
   count=@photo.votes+=1
   @photo.update_attributes(:votes => count)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "photos" SET "votes" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["votes", 2], ["updated_at", 2016-08-28 21:57:16 UTC], ["id", 3]]

  def create
    @photo = Photo.create(photo_params)
---
INSERT INTO "photos" ("caption", "user_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @photo.update(photo_params)
---
UPDATE "photos" SET "caption" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["caption", "grumpy simon"], ["updated_at", 2016-08-29 14:39:43 UTC], ["id", 5]]

  def destroy
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]

  def set_photo
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]