app/controllers/photos_controller.rb

UPDATE "photos" SET "votes" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["votes", 1], ["updated_at", 2016-08-28 20:47:23 UTC], ["id", 4]]
---
  def show
   count=@photo.votes+1
   @photo.update_attributes(:votes => count)