app/controllers/registrations_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "bio", "created_at", "updated_at", "password_digest", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)