app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$Z4bUxwn2KINSlHDb3IOeku86PlDxcnABDWKSZ16R/mJFxj3nI1QLO"], ["bio", "love cats around the world"], ["updated_at", 2016-08-29 17:39:42 UTC], ["id", 2]]

  def set_params
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]